## Ejemplo 01

En este ejemplo, vamos a cargar un dataset de meteoritos, quitaremos datos que son NaN (Not a number) y haremos filtros por valores con el Dataframe de pandas

In [2]:
import pandas as pd
import numpy as np
import json

Abrimos la base de datos de meteoritos del archivo JSON, elegimos las columnas que necesitamos, e inspeccionamos los primeros 5 datos

In [3]:
with open("meteoritos.json","rt") as archivo:
    json_meteoritos = json.load(archivo)
    
df_meteoritos = pd.DataFrame.from_dict(json_meteoritos)
dataframe = df_meteoritos[['fall','id','mass','name','reclat','reclong']]
dataframe.head(5)

   fall   id    mass      name      reclat      reclong
0  Fell    1      21    Aachen   50.775000     6.083330
1  Fell    2     720    Aarhus   56.183330    10.233330
2  Fell    6  107000      Abee   54.216670  -113.000000
3  Fell   10    1914  Acapulco   16.883330   -99.900000
4  Fell  370     780   Achiras  -33.166670   -64.950000

El dato 976 tiene valores NaN (Not a Number) lo cual no nos sirve mucho... hay que quitar los datos que no sirven.

In [4]:
dataframe.iloc[976]

fall            Fell
id             23791
mass            1421
name       Talampaya
reclat           NaN
reclong          NaN
Name: 976, dtype: object

In [4]:
dataframe = dataframe.dropna(how='any', axis=0)
dataframe.head(5)

   fall   id    mass      name      reclat      reclong
0  Fell    1      21    Aachen   50.775000     6.083330
1  Fell    2     720    Aarhus   56.183330    10.233330
2  Fell    6  107000      Abee   54.216670  -113.000000
3  Fell   10    1914  Acapulco   16.883330   -99.900000
4  Fell  370     780   Achiras  -33.166670   -64.950000

Vamos a forzar a convertir los datos de cada columna.

In [5]:
convert_dictionary= {
    'fall':str,
    'id':int,
    'mass':float,
    'name':str,
    'reclat':float,
    'reclong':float
}
df_converted = dataframe.astype(convert_dictionary)
df_converted.dtypes

fall        object
id           int64
mass       float64
name        object
reclat     float64
reclong    float64
dtype: object

## Filtrando por valores
Una vez que tenemos los dataframes limpios, podemos filtrar los datos de los meteoritos, por ejemplo, aquellos que solo tienen una masa mayor a 1000

In [6]:
df_large = df_converted[df_converted['mass'] >= 1000]
df_large

     fall     id      mass       name    reclat    reclong
2    Fell      6  107000.0       Abee  54.21667 -113.00000
3    Fell     10    1914.0   Acapulco  16.88333  -99.90000
5    Fell    379    4239.0   Adhi Kot  32.10000   71.80000
7    Fell    392   30000.0       Agen  44.21667    0.61667
8    Fell    398    1620.0     Aguada -31.60000  -65.23333
..    ...    ...       ...        ...       ...        ...
993  Fell  23999    3000.0  Tillaberi  14.25000    1.53333
994  Fell  24004   65500.0   Timochin  54.50000   35.20000
996  Fell  54823    7000.0    Tissint  29.48195   -7.61123
997  Fell  24011   20000.0      Tjabe  -7.08333  111.53333
998  Fell  24012   16500.0   Tjerebon  -6.66667  106.58333

[668 rows x 6 columns]

In [8]:
prueba = df_converted[df_converted['mass'].isnull()] # es lo mismo usar is isna
prueba

     fall     id  mass               name    reclat    reclong
12   Fell    425   NaN    Aire-sur-la-Lys  50.66667    2.33333
38   Fell   2301   NaN             Angers  47.46667   -0.55000
76   Fell   4944   NaN  Barcelona (stone)  41.36667    2.16667
93   Fell   5009   NaN           Belville -32.33333  -64.86667
172  Fell   5292   NaN  Castel Berardenga  43.35000   11.50000
204  Fell   5356   NaN            Chitado -17.35000   13.96667
262  Fell   7749   NaN             Dunhua  43.33333  128.25000
308  Fell  10166   NaN      Fort Flatters  28.25000    7.00000
312  Fell  10838   NaN              Fünen  55.33333   10.33333
320  Fell  10854   NaN         Gao-Guenie  11.65000   -2.18333
324  Fell  10866   NaN      Gasseltepaoua  14.15083   -2.04167
346  Fell  11436   NaN           Guangnan  24.10000  105.00000
392  Fell  11994   NaN            Ibrisim  38.00000   35.00000
562  Fell  14759   NaN             Lusaka  -7.21667   29.43333
578  Fell  15397   NaN            Malotas -28.93333  -63.23333
645  Fell  16733   NaN              Monze -15.96667   27.35000
665  Fell  16887   NaN       Myhee Caunta  23.05000   72.63333
679  Fell  16914   NaN              Narni  42.51667   12.51667
693  Fell  16970   NaN            Nicorps  49.03333   -1.43333
710  Fell  17934   NaN          Novy-Ergi  58.55000   31.33333
730  Fell  18012   NaN       Oliva-Gandia  39.00000   -0.03333
748  Fell  18062   NaN             Owrucz  51.33333   28.83333
752  Fell  18073   NaN        Palahatchie  32.31667  -89.71667
775  Fell  18179   NaN                 Pê  11.33367   -3.54217
787  Fell  18804   NaN         Pettiswood  53.53333   -7.33333
793  Fell  18816   NaN             Picote  41.36667   -6.23333
869  Fell  22796   NaN              Sagan  51.53333   14.88333
957  Fell  23726   NaN          Stolzenau  52.53333    9.05000